Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F21B.tmx
Source language: en_us
Languages: zh_cn

source: These 10 Things Will Happen When You Start Stepping Out Of Your Comfort Zone
zh_cn: 开始踏出“舒适区”的十大信号

source: Most people want to be become successful, pursue their passions, and live a life full of happiness and love.
zh_cn: 许多人渴望成功，他们追逐梦想，希望生活美满幸福。

source: The truth is, making your dreams become a reality requires leaving the comfortable environment and challenging yourself on a regular basis.
zh_cn: 事实上，圆梦的过程也是告别成长温室，挑战自己生活习惯的过程。

source: However, it's a minority of people who understand the importance of embracing discomfort in order to lead a regretless and fulfilled lifestyle.
zh_cn: 然而，少有人认识到不舒适感对于无憾、有价值人生的重要性。

source: Many people fear stepping into the unknown and questioning their abilities.
zh_cn: 很多人害怕踏入未知领域，对自己的能力感到怀疑。

source: They fear failure, disapproval, and discomfort.
zh_cn: 他们害怕失败，害怕反对的声音，害怕生活不够舒适。

source: Being aware of the thousands of potential obstacles paralyzes them.
zh_cn: 上千种潜在的困难使他们望而却步。

source: However, once you make the decision to step out of your comfort zone and fully commit to doing this daily, you'll experience many amazing things you wouldn't have otherwise.
zh_cn: 然而，一旦你决定走出舒适区，并每天付出努力，你将会收获很多惊喜，而这些是你在舒适区无法得到的。

source: In this article, I want to encourage you to become comfortable with feeling uncomfortable by showing you the great consequences of embracing discomfort.
zh_cn: 在这篇文章中，我将向大家展示“不适感”的巨大功效，以期大家可以改变对不适感的看法。

source: You'll start growing incredibly quickly
zh_cn: 1.你将飞速成长

source: The moment you fully leave your comfort zone is when you begin developing exceptionally quickly. It's because the only way to extraordinary results is through discomfort.
zh_cn: 完全离开舒适区是飞速成长的开始，也是获得成功的唯一途径。

source: By constantly questioning yourself, you improve your skills and develop new ones. Every new change serves you as a great source of motivation to keep going.
zh_cn: 不断的自我质疑不仅有利于提高已有技能，还可以帮助你获得新技能，每个新的挑战都是你继续前行的巨大动力源泉。

source: It's a like a snowball effect: a will to change a little implants a deep desire to grow more and more. Over time, you notice the huge transformation that took place in your life.
zh_cn: 就像滚雪球效应：细微改变的意愿催生逐渐膨胀的强烈意愿，随着时间的推移，你的生活将发生翻天覆地的变化。

source: You'll begin to love challenging yourself
zh_cn: 2.你将爱上挑战

source: At first, each challenge may seem tough or even impossible.
zh_cn: 最初，挑战看起来如此困难，甚至了无希望。

source: However, once you go through it and deal with whatever life throws at you, you realize how powerful you can become only by accepting the discomfort.
zh_cn: 但是，一旦你成功应对，直面生活中的挑战，你会发现，接受不适感使你变得如此强大。

source: Every time you leave your comfort zone and notice the amazing results, you crave more and more.
zh_cn: 每次你离开舒适区并觉察到令人惊异的成绩，你便希望从中获得更多。

source: This became especially apparent to me once I began taking cold showers.
zh_cn: 例如，我开始洗冷水澡时，这种感觉十分强烈。

source: In the beginning, I felt uncomfortable and wanted to finish the shower as soon as possible.
zh_cn: 最初，我感觉不适，想要尽快结束洗浴。

source: What I noticed, however, is the sense of satisfaction that comes afterward. This feeling beats the initial fear and resentment.
zh_cn: 然而，之后我获得了满足感，消除了先前的恐惧和愤懑。

source: Over time, the negative emotions disappear completely and you feel excited to stay on track.
zh_cn: 渐渐地，负面情绪完全消失，不适感变成了兴奋感。

source: You'll realize all your fears are fictional
zh_cn: 3.你将发现所有的恐惧都是纸老虎

source: If you don't train your mind to work for you, it works against you by default.
zh_cn: 你不利用大脑，大脑就会反过来支配你。

source: As a result, tons of excuses pop up in your head and paralyze your ability to improve.
zh_cn: 你会有大量的借口阻碍能力的提高。

source: Sooner or later, you decide to take action and ignore the negative thoughts.
zh_cn: 早晚有一天，你得决定做点什么，把这些消极的想法从大脑中清除出去。

source: This is the moment when you realize that you often underestimate your skills and overestimate the power of potential obstacles.
zh_cn: 这时，你会意识到自己低估了自己的能力，同时也夸大了潜在困难。

source: What seemed impossible turned out to be doable and even enjoyable.
zh_cn: 曾经不可能的事情变得可行，甚至令人愉悦。

source: Whatever your current goal is that you postpone over and over again, I'd like you to mute the voice that encourages you to put it off and begin working on it, starting either today or tomorrow.
zh_cn: 不论你现在的目标是什么，推迟了多久，不要再理会那些让你推迟的声音，今天或者明天就着手开始工作。

source: You have my word that the results will amaze you!
zh_cn: 相信我，结果一定会令你喜出望外！

source: You'll replace regret with excitement.
zh_cn: 4. 你的兴奋将取代后悔

source: Living a comfortable life isn't exciting.
zh_cn: 舒适的生活是令人沮丧的。

source: It seems nice and warm during the day, but once you go to bed and contemplate another day which went by in which you made zero progress toward your goals, the magic is replaced with a bitter regret.
zh_cn: 白天你会觉得舒适、温暖，然而当你睡前对一天的工作进行考量，却发现一整天一无所获，目标依旧遥远，苦涩的懊悔便会占了上风。

source: You'll laugh at your past self.
zh_cn: 5. 你会嘲笑从前的自己

source: "As you move outside of your comfort zone, what was once the unknown and frightening becomes your new normal."
zh_cn: 你在不舒适的路上走得越远，就越会嘲笑从前那个弱小的自己。

source: You notice your bygone excuses and problems were made-up and absurd. Your current self isn't afraid of challenges or failures.
zh_cn: 你会觉得从前的借口和困难如此荒唐可笑，而如今，面对挑战和失败，你毫无畏惧。

source: You are prepared to mess up from time to time; however, it's never a reason not to do something.
zh_cn: 你对糟糕的局面已经有所准备，这已经不再是阻碍你前进的理由。

source: As I began the journey of self-improvement, I finally understood that your current struggles become a reason to laugh in the future. It all depends on your perspective and attitude.
zh_cn: 在我开始自我提升之旅时，我终于懂得，当下的奋斗是日后自我嘲弄的素材，这取决于你的看法和态度。

source: The same problem or challenge can be a real can of worms or a piece of cake. Whatever it is, it's always fully up to you.
zh_cn: 同一个问题或挑战亦敌亦友，而究竟是前者还是后着，完完全全取决于你自己。

source: You'll find out more about your strengths and weaknesses.
zh_cn: 6. 你将更准确地定位自己的优缺点

source: Constantly questioning yourself leads to discovering your good and bad sides.
zh_cn: 不断的自我怀疑有助于发现自己的优缺点。

source: Each challenge is a new life lesson. Whether you complete it successfully or fail miserably, there's always some value added to your life.
zh_cn: 每个挑战都是一堂课，不论你完胜还是惨败，都会或多或少学到有价值的东西。

source: You can't learn about your true self by lying on the couch, eating nachos, and watching another season of your favorite show.
zh_cn: 躺在沙发上嚼着墨西哥玉米片追自己喜欢的电视节目不会帮助你认识自己。

source: If something is nice and cozy, it probably provides zero value or even worsens your situation.
zh_cn: 在安逸舒适的环境里，你可能什么也学不到，它甚至还可能使你的处境变糟。

source: Let's have a look at eating patterns as an example.
zh_cn: 举个饮食方式的例子。

source: Eating fast food feels good at first, since the food companies spare no effort to make us crave their products.
zh_cn: 快餐店不遗余力地使自己的产品美味诱人，所以最初吃快餐的时候往往感觉不错。

source: But in reality, it's always damaging both to your health and mood.
zh_cn: 但事实上，快餐有损人的身心健康。

source: The exact opposite is true of eating healthy, unprocessed foods.
zh_cn: 而未经加工的将康食品恰恰相反，吃起来并不那么爽口。

source: If you are used to consuming junk, it's uncomfortable initially, but over time, you are proud of making the switch.
zh_cn: 如果你习惯吃垃圾食品，刚开始吃健康食品大概会味同嚼蜡，但是随着时间的推移，你将为自己做出的改变感到自豪。

source: The lesson you learn from this shift is that you can actually control what you put on your plate and choose long-term health over short-term gratification.
zh_cn: 在转变饮食方式的过程中你学到的是掌控自己的食谱，选择长期的健康生活，而不是图一时味蕾之快。

source: You'll boost your self-confidence.
zh_cn: 7. 你的自信心将得到提升

source: Experiencing the results of your hard work and how powerful you are once you decide to be unstoppable improves your self-confidence significantly.
zh_cn: 当你决定势如破竹般大力提升自己的信心时，胜利女神将像你挥手，你会意识到自己有多强大。

source: A person who fears stepping out of their comfort zone is simply unaware of their abilities and competencies.
zh_cn: 害怕踏出舒适区的人只是没有意识到自己的能力和竞争力。

source: However, once discomfort knocks at your door and you open it with a smile on your face, ready to transform yourself, your self-confidence shoots up You realize that whether you can or you can't is absolutely up to you.
zh_cn: 假若“不适”敲响了你的房门，而你笑容灿烂地开门迎接，并且做好了改变自己的准备，你的自信心将得到提高，你将意识到，成功或者失败都是自己一手打造的。

source: Taking that responsibility makes you the master of your own universe, where you start to truly believe in yourself.
zh_cn: 直面“不适”将使你成为自己的主人，你将开始真正“相信自己”。

source: You'll create a new source of incredible satisfaction.
zh_cn: 8. 你将获得巨大满足感的新来源

source: Most comfortable activities seem satisfying on the surface, while, in reality, true fulfillment and joy take place outside of your comfort zone.
zh_cn: 表面上看，大多数舒适的活动使人满足，但实际上，真正的成就和快乐并非产生于舒适区。

source: When I finish a freezing cold shower, I feel great and pumped up for new challenges awaiting for me this very day. When I complete a chapter of my new book, I feel amazing because of making progress.
zh_cn: 当我洗完冷水澡时，我觉得好极了，感觉自己为一整天的挑战做好了准备；当我读完一本新书时，我为自己的进步而雀跃。

source: Same goes for completing a hardcore workout in the gym.
zh_cn: 在健身房完成一套核心训练也会获得相似的满足感。

source: All these activities have one thing in common: the initial phase requires pushing yourself to do them, but once it's over, you feel like a god.
zh_cn: 所有这些都有一个共同点：最初你需要强迫自己去做，但是，一旦你完成了，会觉得自己简直棒呆了。

source: You'll realize the only way to success leads through discomfort.
zh_cn: 9. 你将意识到，通抵成功的路都是不舒适的

source: Over time, you notice the correlation between discomfort and worthwhile things in life.
zh_cn: 随时间的推移，你会意识到不适感和有价值事物的关联。

source: Oftentimes, one does not exist without the other.
zh_cn: 通常他们相辅相成，缺一不可。

source: Short-term discomfort leads to long-term improvement and success.
zh_cn: 短时间的不适感是长期成就和成功的必经之路。

source: Based on my personal experience, most of the achievements I'm proud of started with leaving my comfort zone.
zh_cn: 基于我的个人经历，我大部分引以为豪的成就都开始于我离开舒适区。

source: The fact is, things we want to accomplish require hard work and perseverance.
zh_cn: 不论想要达成什么目标，都需要努力和坚持。

source: You can't expect great satisfaction and contentment from easy and mediocre stuff.
zh_cn: 别指望巨大的满足感可以从平庸的事物中获得。

source: If it scares you, that's a good sign!
zh_cn: 如果路途艰辛使你畏惧，这恰恰是个好兆头。

source: You'll begin inspiring people around you.
zh_cn: 10. 你将开始鼓励身边的人

source: When your attitude changes drastically, people begin to watch you more carefully and feel inspired by your results.
zh_cn: 当你彻底改变态度，人们便开始更加认真地看待你，从你的成就中获得启发。

source: They see that being an average person or an outstanding individual is only a choice and not a foredoom.
zh_cn: 他们会意识到，平庸还是卓越只是基于个人选择，而非命定。

source: Even if some folks discourage you in the beginning, ignore their voices.
zh_cn: 即便起初有非议的声音，走自己的路，让别人说去吧。

source: As the time goes by and you stick to your own rules, you stop looking for others' approval.
zh_cn: 坚持你的规则，一复一日，你将不再寻求别人的支持。

source: Sooner or later, the naysayers will either become overwhelmed by your results and inspired to change their minds, or you'll no longer hear them.
zh_cn: 总有一天，你的成功将使不看好你的人哑口无言，他们进而会改变自己的看法，而你也将不再为他们的声音所左右。
